---
type: MEPConnectorInfo
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# MEPConnectorInfo

`Autodesk.Revit.DB.MEPConnectorInfo` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsPrimary | 2016 | `public bool IsPrimary { get ; }` |
| Property | IsSecondary | 2016 | `public bool IsSecondary { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | LinkedConnector | 2016 | `public Connector LinkedConnector { get ; }` |